{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "greeting",
    "1": "goodbye",
    "2": "creator",
    "3": "name",
    "4": "hours",
    "5": "number",
    "6": "course",
    "7": "fees",
    "8": "location",
    "9": "hostel",
    "10": "event",
    "11": "document",
    "12": "floors",
    "13": "syllabus",
    "14": "library",
    "15": "infrastructure",
    "16": "canteen",
    "17": "menu",
    "18": "placement",
    "19": "principal",
    "20": "CSE",
    "21": "CAI",
    "22": "AIDS",
    "23": "CSM",
    "24": "ECE",
    "25": "IOT",
    "26": "EEE",
    "27": "IT",
    "28": "CIVIL",
    "29": "Mechanical Engineering",
    "30": "Chairman",
    "31": "sem",
    "32": "admission",
    "33": "scholarship",
    "34": "facilities",
    "35": "Google CodeLabs",
    "36": "University Innovation Fellows",
    "37": "transport",
    "38": "IUCEE",
    "39": "SAC",
    "40": "SAC SELECTIONS",
    "41": "clubs",
    "42": "NCC",
    "43": "NSS",
    "44": "sports",
    "45": "uniform",
    "46": "committee",
    "47": "random",
    "48": "swear",
    "49": "vacation",
    "50": "salutaion",
    "51": "task",
    "52": "ragging",
    "53": "hod"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "AIDS": 22,
    "CAI": 21,
    "CIVIL": 28,
    "CSE": 20,
    "CSM": 23,
    "Chairman": 30,
    "ECE": 24,
    "EEE": 26,
    "Google CodeLabs": 35,
    "IOT": 25,
    "IT": 27,
    "IUCEE": 38,
    "Mechanical Engineering": 29,
    "NCC": 42,
    "NSS": 43,
    "SAC": 39,
    "SAC SELECTIONS": 40,
    "University Innovation Fellows": 36,
    "admission": 32,
    "canteen": 16,
    "clubs": 41,
    "committee": 46,
    "course": 6,
    "creator": 2,
    "document": 11,
    "event": 10,
    "facilities": 34,
    "fees": 7,
    "floors": 12,
    "goodbye": 1,
    "greeting": 0,
    "hod": 53,
    "hostel": 9,
    "hours": 4,
    "infrastructure": 15,
    "library": 14,
    "location": 8,
    "menu": 17,
    "name": 3,
    "number": 5,
    "placement": 18,
    "principal": 19,
    "ragging": 52,
    "random": 47,
    "salutaion": 50,
    "scholarship": 33,
    "sem": 31,
    "sports": 44,
    "swear": 48,
    "syllabus": 13,
    "task": 51,
    "transport": 37,
    "uniform": 45,
    "vacation": 49
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.30.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
